[
  {
    "name": "Portfolio Bento design en React",
    "description": "Un portfolio personnel développé avec React et CSS",
    "technologies": ["React", "CSS"],
    "githubLink": "https://github.com/pierregourinat/bentofolio"
  },
  {
    "name": "Implémentation du frontend d’une application bancaire avec React",
    "description": "La mission principale ici était d’intégrer le front-end avec le backend via des appels API et la gestion du state des composants grâce à la technologie Redux. J’ai pris en charge  la création de l’authentification de l’utilisateur, les appels à l’API REST, le développement du tableau de bord complet et responsive et enfin la gestion des données de l’application avec Redux. Cet important projet comprenait également l’utilisation d’une documentation Swagger et NodeJS pour exécuter le code Javascript côté serveur.",
    "technologies": ["React", "Redux", "API REST", "Swagger", "NodeJS"],
    "githubLink": "https://github.com/pierregourinat/ArgentBank-Frontend"
  },
  {
    "name": "Création d’une application web de location immobilière avec React",
    "description": "Le développement moderne a apporté une bibliothèque Javascript populaire pour la création d’interfaces utilisateur qu’est React, que j’ai exploré à travers l’élaboration des ses composants réutilisables. React Router a été également un élément essentiel que j’ai du assimiler pour configurer la navigation entre les différentes pages de l’application.",
    "technologies": ["React", "React Router"],
    "githubLink": "https://github.com/pierregourinat/Projet8_SEO_NinaCarducci"
  },
  {
    "name": "Amélioration de l’interface d’un site mobile avec des animations CSS",
    "description": "Enrichir l’expérience de l’utilisateur avec des animations CSS, tel a été mon objectif sur cette interface. Pour ce faire, l’utilisation du préprocesseur SASS était obligatoire, établissant une bonne introduction au langage et ses spécificités pour organiser un code maintenable. L’exploration des différentes propriétés permettant la création d’animations fluides a été un exercice important dans l’apprentissage de ce domaine.",
    "technologies": ["SASS", "Animation CSS"],
    "githubLink": "https://github.com/pierregourinat/Projet-4---OhMyFood"
  },
  {
    "name": "Création de la page d’accueil d’une agence de voyage en HMTL et CSS",
    "description": "Ce premier projet consistait à réaliser une interface responsive entre mobile, tablette et desktop. Il m’a permis de manipuler les langages HTML et CSS avec lesquels j’étais déjà familier, ainsi que d’explorer plus en détail la règle CSS @media. Un premier projet concret alliant l’utilisation d’une maquette Figma et la compréhension des enjeux liés aux tailles d’écrans. ",
    "technologies": ["HTML", "CSS", "Responsive design"],
    "githubLink": "https://github.com/pierregourinat/Booki"
  }
]
